pjpfxq/Infineon_Mcal/Src/Infra_Prod/Sfr/TC33xA_ED/_Reg/IfxRif_bf.h
/** \brief Mask for Ifx_RIF_DBG1_Bits.DD3 */
#define IFX_RIF_DBG1_DD3_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_DBG1_Bits.DD3 */
#define IFX_RIF_DBG1_DD3_OFF (0u)

/** \brief Length for Ifx_RIF_DBG1_Bits.DD4 */
#define IFX_RIF_DBG1_DD4_LEN (16u)

/** \brief Mask for Ifx_RIF_DBG1_Bits.DD4 */
#define IFX_RIF_DBG1_DD4_MSK (0xffffu)

/** \brief Offset for Ifx_RIF_DBG1_Bits.DD4 */
#define IFX_RIF_DBG1_DD4_OFF (16u)

/** \brief Length for Ifx_RIF_SFCON_Bits.LOCKIEN */
#define IFX_RIF_SFCON_LOCKIEN_LEN (2u)

/** \brief Mask for Ifx_RIF_SFCON_Bits.LOCKIEN */
#define IFX_RIF_SFCON_LOCKIEN_MSK (0x3u)

/** \brief Offset for Ifx_RIF_SFCON_Bits.LOCKIEN */
#define IFX_RIF_SFCON_LOCKIEN_OFF (0u)

/** \brief Length for Ifx_RIF_SFCON_Bits.SPUCRCEN */
#define IFX_RIF_SFCON_SPUCRCEN_LEN (2u)

/** \brief Mask for Ifx_RIF_SFCON_Bits.SPUCRCEN */
#define IFX_RIF_SFCON_SPUCRCEN_MSK (0x3u)

/** \brief Offset for Ifx_RIF_SFCON_Bits.SPUCRCEN */
#define IFX_RIF_SFCON_SPUCRCEN_OFF (2u)

/** \brief Length for Ifx_RIF_REGCRC_Bits.CRC */
#define IFX_RIF_REGCRC_CRC_LEN (32u)

/** \brief Mask for Ifx_RIF_REGCRC_Bits.CRC */
#define IFX_RIF_REGCRC_CRC_MSK (0xffffffffu)

/** \brief Offset for Ifx_RIF_REGCRC_Bits.CRC */
#define IFX_RIF_REGCRC_CRC_OFF (0u)

/** \brief Length for Ifx_RIF_OCS_Bits.TGS */
#define IFX_RIF_OCS_TGS_LEN (2u)

/** \brief Mask for Ifx_RIF_OCS_Bits.TGS */
#define IFX_RIF_OCS_TGS_MSK (0x3u)

/** \brief Offset for Ifx_RIF_OCS_Bits.TGS */
#define IFX_RIF_OCS_TGS_OFF (0u)

/** \brief Length for Ifx_RIF_OCS_Bits.TGB */
#define IFX_RIF_OCS_TGB_LEN (1u)

/** \brief Mask for Ifx_RIF_OCS_Bits.TGB */
#define IFX_RIF_OCS_TGB_MSK (0x1u)

/** \brief Offset for Ifx_RIF_OCS_Bits.TGB */
#define IFX_RIF_OCS_TGB_OFF (2u)

/** \brief Length for Ifx_RIF_OCS_Bits.TG_P */
#define IFX_RIF_OCS_TG_P_LEN (1u)

/** \brief Mask for Ifx_RIF_OCS_Bits.TG_P */
#define IFX_RIF_OCS_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_RIF_OCS_Bits.TG_P */
#define IFX_RIF_OCS_TG_P_OFF (3u)

/** \brief Length for Ifx_RIF_OCS_Bits.SUS */
#define IFX_RIF_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_RIF_OCS_Bits.SUS */
#define IFX_RIF_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_RIF_OCS_Bits.SUS */
#define IFX_RIF_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_RIF_OCS_Bits.SUS_P */
#define IFX_RIF_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_RIF_OCS_Bits.SUS_P */
#define IFX_RIF_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_RIF_OCS_Bits.SUS_P */
#define IFX_RIF_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_RIF_OCS_Bits.SUSSTA */
#define IFX_RIF_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_RIF_OCS_Bits.SUSSTA */
#define IFX_RIF_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_RIF_OCS_Bits.SUSSTA */
#define IFX_RIF_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_RIF_KRSTCLR_Bits.CLR */
#define IFX_RIF_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_RIF_KRSTCLR_Bits.CLR */
#define IFX_RIF_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_RIF_KRSTCLR_Bits.CLR */
#define IFX_RIF_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_RIF_KRST1_Bits.RST */
#define IFX_RIF_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_RIF_KRST1_Bits.RST */
#define IFX_RIF_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_RIF_KRST1_Bits.RST */
#define IFX_RIF_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_RIF_KRST0_Bits.RST */
#define IFX_RIF_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_RIF_KRST0_Bits.RST */
#define IFX_RIF_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_RIF_KRST0_Bits.RST */
#define IFX_RIF_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_RIF_KRST0_Bits.RSTSTAT */
#define IFX_RIF_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_RIF_KRST0_Bits.RSTSTAT */
#define IFX_RIF_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_RIF_KRST0_Bits.RSTSTAT */
#define IFX_RIF_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN0 */
#define IFX_RIF_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN0 */
#define IFX_RIF_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN0 */
#define IFX_RIF_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN1 */
#define IFX_RIF_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN1 */
#define IFX_RIF_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN1 */
#define IFX_RIF_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN2 */
#define IFX_RIF_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN2 */
#define IFX_RIF_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN2 */
#define IFX_RIF_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN3 */
#define IFX_RIF_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN3 */
#define IFX_RIF_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN3 */
#define IFX_RIF_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN4 */
#define IFX_RIF_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN4 */
#define IFX_RIF_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN4 */
#define IFX_RIF_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN5 */
#define IFX_RIF_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN5 */
#define IFX_RIF_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN5 */
#define IFX_RIF_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN6 */
#define IFX_RIF_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN6 */
#define IFX_RIF_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN6 */
#define IFX_RIF_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN7 */
#define IFX_RIF_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN7 */
#define IFX_RIF_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN7 */
#define IFX_RIF_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN8 */
#define IFX_RIF_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN8 */
#define IFX_RIF_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_RIF_ACCEN0_Bits.EN8 */
#define IFX_RIF_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_RIF_ACCEN0_Bits.EN9 */
#define IFX_RIF_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_RIF_ACCEN0_Bits.EN9 */
#define IFX_RIF_ACCEN0_EN9_MSK (0x1u)

